# Реализуйте алгоритм перемешивания списка.

import random

array = input('Введите список: ').split()

print(array)
random.shuffle(array)
print(array)
